Revit 2024 API
BuiltInFailures.SketchFailures.ShortCurveInSketch Property
 The sketch contains an extremely short line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ShortCurveInSketch { get; }
Visual Basic
Public Shared ReadOnly Property ShortCurveInSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ShortCurveInSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace